# GetParameterTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterUtils..::..GetParameterTypeId Method
ParameterUtils Class See Also
---
Gets the ForgeTypeId identifying the built-in parameter corresponding to the given BuiltInParameter value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GetParameterTypeId(
	BuiltInParameter builtInParam
)
```

Visual Basic
---
```text
Public Shared Function GetParameterTypeId ( _
	builtInParam As BuiltInParameter _
) As ForgeTypeId
```

Visual C++
---
```text
public:
static ForgeTypeId^ GetParameterTypeId(
	BuiltInParameter builtInParam
)
```

# ### Parameters
builtInParam
    Type: Autodesk.Revit.DB..::..BuiltInParameterThe BuiltInParameter value.
# ### Return Value
Identifier of the parameter corresponding to the given BuiltInParameter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace